routes/api.php

select * from `polls`
---
Route::get('/v1/polls/result/{id}', [PollController::class, 'result']); // get poll result by id

// Protected Routes (need a valid token to access)
Route::group(['middleware' => ['auth:sanctum']], function () {
  Route::get('/v1/user-poll', [PollController::class, 'userPoll']); // get all poll created by id current user
  Route::put('/v1/users', [AuthController::class, 'update']); // update user by id current user
  Route::post('/v1/polls', [PollController::class, 'store']); // create poll
  Route::put('/v1/polls/{id}', [PollController::class, 'update']); // update poll by id
  Route::delete('/v1/polls/{id}', [PollController::class, 'destroy']); // delete poll by id
  Route::post('/v1/logout', [AuthController::class, 'logout']); // logout
  Route::post('/v1/polls/{id}/vote', [VoterController::class, 'store']); // vote option
});